In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy import nan as NA

In [13]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna() #NA data removal

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()] #other method for removing NA data

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data.dropna(inplace = True)  #real data me changes
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data.fillna(0)

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [20]:
data.fillna({1 : 0 , 2: 1, 0:3}) #filling values in place of other values

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  1.0
2  3.0  0.0  1.0
3  3.0  6.5  3.0

In [22]:
data.dropna() #row hata de jaha null he

     0    1    2
0  1.0  6.5  3.0

In [24]:
data.dropna(how = "all")  #remove row which all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data [4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data.dropna(how = "all") #rows remove where all are NA

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna(how = "all", axis =1)  #columns remove where all are NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [51]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[4:,1] = NA
df.iloc[:2, 2] = NA

In [52]:
df

          0         1         2
0 -0.097320  1.686822       NaN
1 -1.088443  2.253543       NaN
2 -0.564435 -1.165002  1.245016
3 -0.150763 -0.365426 -0.290846
4 -0.459157       NaN -0.250410
5 -1.629377       NaN -0.182176
6 -0.038001       NaN  1.208870

In [57]:
df.dropna(thresh =3) #kamas kam 3 not null value hone chaye rows me

          0         1         2
2 -0.564435 -1.165002  1.245016
3 -0.150763 -0.365426 -0.290846

In [59]:
df.fillna({0 : 3, 1 : 4, 2 : 5})  
#column 0 me null he to 3 put kare, column 1 par 4 ...

          0         1         2
0 -0.097320  1.686822  5.000000
1 -1.088443  2.253543  5.000000
2 -0.564435 -1.165002  1.245016
3 -0.150763 -0.365426 -0.290846
4 -0.459157  4.000000 -0.250410
5 -1.629377  4.000000 -0.182176
6 -0.038001  4.000000  1.208870

In [60]:
df.fillna(method = "bfill")

          0         1         2
0 -0.097320  1.686822  1.245016
1 -1.088443  2.253543  1.245016
2 -0.564435 -1.165002  1.245016
3 -0.150763 -0.365426 -0.290846
4 -0.459157       NaN -0.250410
5 -1.629377       NaN -0.182176
6 -0.038001       NaN  1.208870

In [62]:
df.fillna(method = "ffill")

          0         1         2
0 -0.097320  1.686822       NaN
1 -1.088443  2.253543       NaN
2 -0.564435 -1.165002  1.245016
3 -0.150763 -0.365426 -0.290846
4 -0.459157 -0.365426 -0.250410
5 -1.629377 -0.365426 -0.182176
6 -0.038001 -0.365426  1.208870

In [65]:
#backword fill karo lekin sirf 2 dafa (limit de de)
df.fillna(method = "ffill", limit =2)

          0         1         2
0 -0.097320  1.686822       NaN
1 -1.088443  2.253543       NaN
2 -0.564435 -1.165002  1.245016
3 -0.150763 -0.365426 -0.290846
4 -0.459157 -0.365426 -0.250410
5 -1.629377 -0.365426 -0.182176
6 -0.038001       NaN  1.208870

In [66]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [67]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [68]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [86]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [87]:
data.drop_duplicates(['k1']) 
#eg CNIC wale column me duplicate hata deya

    k1  k2  v1
0  one   1   0
1  two   1   1

In [88]:
data.drop_duplicates(['k1', 'k2']) 
#dono columns ke base par remove karega like row 6

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [89]:
data.drop_duplicates(['k1', 'k2'], keep= 'last')
#dono columns ke base par remove karega but 
#remove previous wale ko karega like row 5

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [91]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
 'pastrami', 'honey ham', 'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [92]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [94]:
#meat_to_animal & data both have food column

In [97]:
lowerCase = data['food'].str.lower()
lowerCase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [99]:
data['animal'] = lowerCase.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [101]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [104]:
data.replace(-999, np.nan) #-999 ki jaga nan daal dya

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [105]:
data.replace([-999, -1000], [4, 5])

0    1.0
1    4.0
2    2.0
3    4.0
4    5.0
5    3.0
dtype: float64

In [106]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 index=['Ohio', 'Colorado', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [107]:
#column name change
data.rename(index = str.lower, columns = str.upper)

          ONE  TWO  THREE  FOUR
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [111]:
data.rename(index = {'Ohio': 'karachi', 'Colorado': 'Lahore'}, 
            columns = {'three' : 'KPK', 'one' : 'Sindh'})

          Sindh  two  KPK  four
karachi       0    1    2     3
Lahore        4    5    6     7
New York      8    9   10    11

In [113]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [120]:
bins = [18, 25, 35, 60, 100] #4 categories
#18-25  25 not included   25-35   35 not included
bins

[18, 25, 35, 60, 100]

In [121]:
cats = pd.cut(ages, bins)
cats
#checking ages in which category it lies

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [126]:
cats.codes   #index konsa he accordign to category

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [127]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [129]:
pd.value_counts(cats) #kis category me kitne values hen

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

# Hierarchical Indexing

In [130]:
data = pd.Series(np.random.randn(9),
 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
 [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -1.286350
   2   -0.778961
   3   -1.061023
b  1    0.391033
   3   -0.982067
c  1    0.636871
   2   -0.888364
d  2   -3.302711
   3    0.237139
dtype: float64

In [131]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [132]:
data['a']

1   -1.286350
2   -0.778961
3   -1.061023
dtype: float64

In [137]:
data[2] #index 2  (3rd value)

-1.061022756975635

In [138]:
data['a',1]

-1.2863501113912108

In [139]:
#OR
data['a'][1]

-1.2863501113912108

In [142]:
data.loc['a']  #khudi index lega

1   -1.286350
2   -0.778961
3   -1.061023
dtype: float64

In [145]:
data.unstack()  #products (1,2,3)  company(a,b,c) khudi bna dya

          1         2         3
a -1.286350 -0.778961 -1.061023
b  0.391033       NaN -0.982067
c  0.636871 -0.888364       NaN
d       NaN -3.302711  0.237139

In [146]:
data.loc[:,2]

a   -0.778961
c   -0.888364
d   -3.302711
dtype: float64

In [148]:
data[2]  #after unstack horizontal data dega

-1.061022756975635

In [151]:
data.unstack().stack()  #original form works vertically

a  1   -1.286350
   2   -0.778961
   3   -1.061023
b  1    0.391033
   3   -0.982067
c  1    0.636871
   2   -0.888364
d  2   -3.302711
   3    0.237139
dtype: float64

In [152]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],
 ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [153]:
frame.index.names = ['key1', 'key2']

In [154]:
frame.columns.name = ['state', 'color']

In [155]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [156]:
frame['Ohio']

           Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [158]:
frame.swaplevel()  #swap kar deya

           Ohio     Colorado
          Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [161]:
frame.sort_index(level=1)
frame.swaplevel(0,1).sort_index(level-0)

NameError: name 'level' is not defined

In [162]:
frame.sum(level='color', axis=1)

KeyError: 'Level color not found'